{
 "array_types" :
 [
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIA0_i",
   "name" : "int[0]",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIA0_i",
   "source_file" : "system/core/include/cutils/native_handle.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "_ZTIA32_h",
   "name" : "unsigned char[32]",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIA32_h",
   "size" : 32,
   "source_file" : "hardware/interfaces/graphics/mapper/stable-c/include/android/hardware/graphics/mapper/IMapper.h"
  }
 ],
 "builtin_types" :
 [
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIb",
   "name" : "bool",
   "referenced_type" : "_ZTIb",
   "self_type" : "_ZTIb",
   "size" : 1
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIc",
   "name" : "char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIc",
   "size" : 1
  },
  {
   "alignment" : 8,
   "linker_set_key" : "_ZTIe",
   "name" : "long double",
   "referenced_type" : "_ZTIe",
   "self_type" : "_ZTIe",
   "size" : 8
  },
  {
   "alignment" : 1,
   "is_integral" : true,
   "is_unsigned" : true,
   "linker_set_key" : "_ZTIh",
   "name" : "unsigned char",
   "referenced_type" : "_ZTIh",
   "self_type" : "_ZTIh",
   "size" : 1
  },
  {
   "alignment" : 4,
   "is_integral" : true,
   "linker_set_key" : "_ZTIi",
   "name" : "int",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIi",
   "size" : 4
  },

   "name" : "void (*)(void *, AIMapper_MetadataType, const void *, unsigned int)",
   "referenced_type" : "_ZTIFvPv21AIMapper_MetadataTypePKvjE",
   "self_type" : "_ZTIPFvPv21AIMapper_MetadataTypePKvjE",
   "size" : 4,
   "source_file" : "hardware/interfaces/graphics/mapper/stable-c/include/android/hardware/graphics/mapper/IMapper.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPFvPvE",
   "name" : "void (*)(void *)",
   "referenced_type" : "_ZTIFvPvE",
   "self_type" : "_ZTIPFvPvE",
   "size" : 4,
   "source_file" : "hardware/interfaces/graphics/mapper/stable-c/include/android/hardware/graphics/mapper/IMapper.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPK13native_handle",
   "name" : "const native_handle *",
   "referenced_type" : "_ZTIK13native_handle",
   "self_type" : "_ZTIPK13native_handle",
   "size" : 4,
   "source_file" : "hardware/interfaces/graphics/mapper/stable-c/include/android/hardware/graphics/mapper/IMapper.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPK32AIMapper_MetadataTypeDescription",
   "name" : "const AIMapper_MetadataTypeDescription *",
   "referenced_type" : "_ZTIK32AIMapper_MetadataTypeDescription",
   "self_type" : "_ZTIPK32AIMapper_MetadataTypeDescription",
   "size" : 4,
   "source_file" : "hardware/interfaces/graphics/mapper/stable-c/include/android/hardware/graphics/mapper/IMapper.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPKc",
   "name" : "const char *",
   "referenced_type" : "_ZTIKc",
   "self_type" : "_ZTIPKc",
   "size" : 4,
   "source_file" : "hardware/interfaces/graphics/mapper/stable-c/include/android/hardware/graphics/mapper/IMapper.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPKv",
   "name" : "const void *",
   "referenced_type" : "_ZTIKv",
   "self_type" : "_ZTIPKv",
   "size" : 4,
   "source_file" : "hardware/interfaces/graphics/mapper/stable-c/include/android/hardware/graphics/mapper/IMapper.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPP8AIMapper",
   "name" : "AIMapper **",
   "referenced_type" : "_ZTIP8AIMapper",
   "self_type" : "_ZTIPP8AIMapper",
   "size" : 4,
   "source_file" : "hardware/interfaces/graphics/mapper/stable-c/include/android/hardware/graphics/mapper/IMapper.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPPK13native_handle",
   "name" : "const native_handle **",
   "referenced_type" : "_ZTIPK13native_handle",
   "self_type" : "_ZTIPPK13native_handle",
   "size" : 4,
   "source_file" : "hardware/interfaces/graphics/mapper/stable-c/include/android/hardware/graphics/mapper/IMapper.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPPK32AIMapper_MetadataTypeDescription",
   "name" : "const AIMapper_MetadataTypeDescription **",
   "referenced_type" : "_ZTIPK32AIMapper_MetadataTypeDescription",
   "self_type" : "_ZTIPPK32AIMapper_MetadataTypeDescription",
   "size" : 4,
   "source_file" : "hardware/interfaces/graphics/mapper/stable-c/include/android/hardware/graphics/mapper/IMapper.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPPv",
   "name" : "void **",
   "referenced_type" : "_ZTIPv",
   "self_type" : "_ZTIPPv",
   "size" : 4,
   "source_file" : "hardware/interfaces/graphics/mapper/stable-c/include/android/hardware/graphics/mapper/IMapper.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPi",
   "name" : "int *",
   "referenced_type" : "_ZTIi",
   "self_type" : "_ZTIPi",
   "size" : 4,
   "source_file" : "hardware/interfaces/graphics/mapper/stable-c/include/android/hardware/graphics/mapper/IMapper.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPj",
   "name" : "unsigned int *",
   "referenced_type" : "_ZTIj",
   "self_type" : "_ZTIPj",
   "size" : 4,
   "source_file" : "hardware/interfaces/graphics/mapper/stable-c/include/android/hardware/graphics/mapper/IMapper.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPv",
   "name" : "void *",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIPv",
   "size" : 4,
   "source_file" : "hardware/interfaces/graphics/mapper/stable-c/include/android/hardware/graphics/mapper/IMapper.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "_ZTIPy",
   "name" : "unsigned long long *",
   "referenced_type" : "_ZTIy",
   "self_type" : "_ZTIPy",
   "size" : 4,
   "source_file" : "hardware/interfaces/graphics/mapper/stable-c/include/android/hardware/graphics/mapper/IMapper.h"
  }
 ],
 "qualified_types" :
 [
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "_ZTIK13native_handle",
   "name" : "const native_handle",
   "referenced_type" : "_ZTI13native_handle",
   "self_type" : "_ZTIK13native_handle",
   "size" : 12,
   "source_file" : "hardware/interfaces/graphics/mapper/stable-c/include/android/hardware/graphics/mapper/IMapper.h"
  },
  {
   "alignment" : 8,
   "is_const" : true,
   "linker_set_key" : "_ZTIK32AIMapper_MetadataTypeDescription",
   "name" : "const AIMapper_MetadataTypeDescription",
   "referenced_type" : "_ZTI32AIMapper_MetadataTypeDescription",
   "self_type" : "_ZTIK32AIMapper_MetadataTypeDescription",
   "size" : 56,
   "source_file" : "hardware/interfaces/graphics/mapper/stable-c/include/android/hardware/graphics/mapper/IMapper.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "_ZTIKc",
   "name" : "const char",
   "referenced_type" : "_ZTIc",
   "self_type" : "_ZTIKc",
   "size" : 1,
   "source_file" : "hardware/interfaces/graphics/mapper/stable-c/include/android/hardware/graphics/mapper/IMapper.h"
  },
  {
   "is_const" : true,
   "linker_set_key" : "_ZTIKv",
   "name" : "const void",
   "referenced_type" : "_ZTIv",
   "self_type" : "_ZTIKv",
   "source_file" : "hardware/interfaces/graphics/mapper/stable-c/include/android/hardware/graphics/mapper/IMapper.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "importBuffer",
     "referenced_type" : "_ZTIPF14AIMapper_ErrorPK13native_handlePS2_E"
    },
    {
     "field_name" : "freeBuffer",
     "field_offset" : 32,
     "referenced_type" : "_ZTIPF14AIMapper_ErrorPK13native_handleE"
    },
    {
     "field_name" : "getTransportSize",
     "field_offset" : 64,
     "referenced_type" : "_ZTIPF14AIMapper_ErrorPK13native_handlePjS3_E"
    },
    {
     "field_name" : "lock",
     "field_offset" : 96,
     "referenced_type" : "_ZTIPF14AIMapper_ErrorPK13native_handley5ARectiPPvE"
    },
    {
     "field_name" : "unlock",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPF14AIMapper_ErrorPK13native_handlePiE"
    },
    {
     "field_name" : "flushLockedBuffer",
     "field_offset" : 160,
     "referenced_type" : "_ZTIPF14AIMapper_ErrorPK13native_handleE"
    },
    {
     "field_name" : "rereadLockedBuffer",
     "field_offset" : 192,
     "referenced_type" : "_ZTIPF14AIMapper_ErrorPK13native_handleE"
    },
    {
     "field_name" : "getMetadata",
     "field_offset" : 224,
     "referenced_type" : "_ZTIPFiPK13native_handle21AIMapper_MetadataTypePvjE"
    },
    {
     "field_name" : "getStandardMetadata",
     "field_offset" : 256,
     "referenced_type" : "_ZTIPFiPK13native_handlexPvjE"
    },
    {
     "field_name" : "setMetadata",
     "field_offset" : 288,
     "referenced_type" : "_ZTIPF14AIMapper_ErrorPK13native_handle21AIMapper_MetadataTypePKvjE"
    },
    {
     "field_name" : "setStandardMetadata",
     "field_offset" : 320,
     "referenced_type" : "_ZTIPF14AIMapper_ErrorPK13native_handlexPKvjE"
    },
    {
     "field_name" : "listSupportedMetadataTypes",
     "field_offset" : 352,
     "referenced_type" : "_ZTIPF14AIMapper_ErrorPPK32AIMapper_MetadataTypeDescriptionPjE"
    },
    {
     "field_name" : "dumpBuffer",
     "field_offset" : 384,
     "referenced_type" : "_ZTIPF14AIMapper_ErrorPK13native_handlePFvPv21AIMapper_MetadataTypePKvjES3_E"
    },
    {
     "field_name" : "dumpAllBuffers",
     "field_offset" : 416,
     "referenced_type" : "_ZTIPF14AIMapper_ErrorPFvPvEPFvS0_21AIMapper_MetadataTypePKvjES0_E"
    },
    {
     "field_name" : "getReservedRegion",
     "field_offset" : 448,
     "referenced_type" : "_ZTIPF14AIMapper_ErrorPK13native_handlePPvPyE"
    }
   ],
   "linker_set_key" : "_ZTI10AIMapperV5",
   "name" : "AIMapperV5",
   "referenced_type" : "_ZTI10AIMapperV5",
   "self_type" : "_ZTI10AIMapperV5",
   "size" : 60,
   "source_file" : "hardware/interfaces/graphics/mapper/stable-c/include/android/hardware/graphics/mapper/IMapper.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "__clang_max_align_nonce1",
     "referenced_type" : "_ZTIx"
    },
    {
     "field_name" : "__clang_max_align_nonce2",
     "field_offset" : 64,
     "referenced_type" : "_ZTIe"
    }
   ],
   "linker_set_key" : "_ZTI11max_align_t",
   "name" : "max_align_t",
   "referenced_type" : "_ZTI11max_align_t",
   "self_type" : "_ZTI11max_align_t",
   "size" : 16,
   "source_file" : "prebuilts/clang-tools/linux-x86/clang-headers/__stddef_max_align_t.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "version",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "numFds",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "numInts",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "data",
     "field_offset" : 96,
     "referenced_type" : "_ZTIA0_i"
    }
   ],
   "linker_set_key" : "_ZTI13native_handle",
   "name" : "native_handle",
   "referenced_type" : "_ZTI13native_handle",
   "self_type" : "_ZTI13native_handle",
   "size" : 12,
   "source_file" : "system/core/include/cutils/native_handle.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "name",
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "value",
     "field_offset" : 64,
     "referenced_type" : "_ZTIx"
    }
   ],
   "linker_set_key" : "_ZTI21AIMapper_MetadataType",
   "name" : "AIMapper_MetadataType",
   "referenced_type" : "_ZTI21AIMapper_MetadataType",
   "self_type" : "_ZTI21AIMapper_MetadataType",
   "size" : 16,
   "source_file" : "hardware/interfaces/graphics/mapper/stable-c/include/android/hardware/graphics/mapper/IMapper.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "metadataType",
     "referenced_type" : "_ZTI21AIMapper_MetadataType"
    },
    {
     "field_name" : "description",
     "field_offset" : 128,
     "referenced_type" : "_ZTIPKc"
    },
    {
     "field_name" : "isGettable",
     "field_offset" : 160,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "isSettable",
     "field_offset" : 168,
     "referenced_type" : "_ZTIb"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 176,
     "referenced_type" : "_ZTIA32_h"
    }
   ],
   "linker_set_key" : "_ZTI32AIMapper_MetadataTypeDescription",
   "name" : "AIMapper_MetadataTypeDescription",
   "referenced_type" : "_ZTI32AIMapper_MetadataTypeDescription",
   "self_type" : "_ZTI32AIMapper_MetadataTypeDescription",
   "size" : 56,
   "source_file" : "hardware/interfaces/graphics/mapper/stable-c/include/android/hardware/graphics/mapper/IMapper.h"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "left",
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "top",
     "field_offset" : 32,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "right",
     "field_offset" : 64,
     "referenced_type" : "_ZTIi"
    },
    {
     "field_name" : "bottom",
     "field_offset" : 96,
     "referenced_type" : "_ZTIi"
    }
   ],
   "linker_set_key" : "_ZTI5ARect",
   "name" : "ARect",
   "referenced_type" : "_ZTI5ARect",
   "self_type" : "_ZTI5ARect",
   "size" : 16,
   "source_file" : "frameworks/native/libs/arect/include/android/rect.h"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "version",
     "referenced_type" : "_ZTI16AIMapper_Version"
    },
    {
     "field_name" : "v5",
     "field_offset" : 32,
     "referenced_type" : "_ZTI10AIMapperV5"
    }
   ],
   "linker_set_key" : "_ZTI8AIMapper",
   "name" : "AIMapper",
   "referenced_type" : "_ZTI8AIMapper",
   "self_type" : "_ZTI8AIMapper",
   "size" : 64,
   "source_file" : "hardware/interfaces/graphics/mapper/stable-c/include/android/hardware/graphics/mapper/IMapper.h"
  }
 ],
 "rvalue_reference_types" : []
}
